Reports/ОстаткиМатериаловПоСвойствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОстаткиМатериаловПоСвойствам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<Comment>Остатки номенклатуры</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОстаткиМатериаловПоСвойствам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры  

&НаСервере
Процедура Отчет() 
	
//1. Предварительный этап
	ТабДок = ТабличныйДокумент; //указываем тип выходных данных
	ТабДок.Очистить();//очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр=Истина;//даем право только на просмотр
	
//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере("Макет"); 
	
//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");
	
//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстаткиИОбороты.НаборСвойств КАК НаборСвойств,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(, , , , НаборСвойств В
	|   	(ВЫБРАТЬ
	|			ЗначенияСвойствНоменклатуры.НаборСвойств КАК НаборСвойств
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствНоменклатуры КАК ЗначенияСвойствНоменклатуры
	|		ГДЕ ";
	
	Если не Отчет.Материал.Пустая() Тогда
		ЗапросДанных.Текст = ЗапросДанных.Текст +
					"ЗначенияСвойствНоменклатуры.НаборСвойств.Владелец = &Материал
	|	        И ";
	КонецЕсли;
	
	ЗапросДанных.Текст = ЗапросДанных.Текст +
				"ЗначенияСвойствНоменклатуры.ВидСвойства = &ВидСвойства
	|			И ЗначенияСвойствНоменклатуры.Значение = &Значение)) 
	|КАК ОстаткиНоменклатурыОстаткиИОбороты    
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	//2.1.1.1. Установка параметров запроса
	Если Не Отчет.Материал.Пустая() Тогда
		ЗапросДанных.УстановитьПараметр("Материал", Отчет.Материал);
	КонецЕсли;
	ЗапросДанных.УстановитьПараметр("ВидСвойства", Отчет.Свойство);
	ЗапросДанных.УстановитьПараметр("Значение", Отчет.ЗначенияСвойства);
	
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();                  
	
//2.1.2 Тут будет производится заполнение полученных данных  

Пока ВыборкаДанных.Следующий() Цикл 
	ОбластьДанные.Параметры.Номенклатура = ВыборкаДанных.Номенклатура;
	ОбластьДанные.Параметры.НаборСвойств = ВыборкаДанных.НаборСвойств;
	ОбластьДанные.Параметры.НачальныйОстаток= ВыборкаДанных.КоличествоНачальныйОстаток;
	ОбластьДанные.Параметры.Приход = ВыборкаДанных.КоличествоПриход;
	ОбластьДанные.Параметры.Расход = ВыборкаДанных.КоличествоРасход;
	ОбластьДанные.Параметры.КонечныйОстаток = ВыборкаДанных.КоличествоКонечныйОстаток;
	ТабДок.Вывести(ОбластьДанные,ВыборкаДанных.Уровень());
КонецЦикла;




//3. Заключительный этап - настройка вывода табличного документа

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТабДок.МасштабПечати = 100;

ТабДок.РазмерСтраницы = "A4";
ТабДок.ТочностьПечати = ТочностьПечати.Точная;
	
	
КонецПроцедуры  

//ВСПОМОГАТЕЛЬНОЕ
  &НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;    
	
КонецФункции
